//ฟังก์ชั่นทางคณิตศาสตร์

import 'dart:math';

int a = -10;
double b = 3.3;
double c = 2.1;

/*

abs()      ค่าตัวเลขแบบไม่ติดลบ
round()    ปัดเศษตามค่าที่ใกล้ที่สุด
ceil()     ปัดเศษขึ้น
floor()    ปัดเศษลง
truncate() ตัดทศนิยมออก
sqrt()     หารากที่สอง
pow()      ยกกำลัง

*/

void main() {
  print("ค่าจตัวเลขแบบไม่ติดลบของ a ($a): ${a.abs()}");

  print(
    "ปัดเศษของ b ($b): ${b.round()}",
  ); //<-- ปัดเศษตามค่าที่ใกล้ที่สุด ถ้าเกิน .5 จะปัดขึ้น

  print("ปัดเศษขึ้นของ c ($c) : ${c.ceil()}");
  print("ปัดเศษลงของ c ($c) : ${c.floor()}");
  print("ตัดทศนิยมออกของ c ($c) : ${c.truncate()}");
  print("หารากที่สองของ 16 : ${sqrt(16)}");
  print("ยกกำลังของ 2^3 : ${pow(2, 3)}");
}
