//Function Main() เป็นจุดเริ่มต้นของการทำงาน

void main() {
  print("Hello"); // <--- Statement
}

// ===== คำอธิบายตามส่วน =====
//void        บอกว่าฟังก์ชันนี้ไม่ต้องการ return ค่าใดๆ
//main        ชื่อฟังก์ชัน (จุดเริ่มต้นการทำงาน)
//Statement   สิ่งที่กำหนดให้ในฟังก์ชัน ทำอะไรบ้าง หรือคืนค่าอะไรออกไป
//();         วงเล็บบอกว่านี่คือฟังก์ชัน
//{ }         การทำงานควรอยู่ในวงเล็บปีกกา
//;           Semicolon สิ้นสุดคำสั่ง

// <- Comment บรรทัดเดียว

/*
  Block Comment
  แบบนี้หลาย
  บรรทัด
*/
