//const และ final เป็นตัวแปรที่ไม่สามารถเปลี่ยนค่าได้หลังจากที่ถูกกำหนดค่าแล้ว

// ===== const (Compile-time Constant) =====
//const จะต้องกำหนดค่าในขณะที่ประกาศตัวแปร
//ค่าจะถูกคำนวณในเวลาคอมไพล์ (compile-time constant)
//ต้องตั้งชื่อเป็นตัวพิมพ์ใหญ่เพื่อแสดงว่าเป็นค่าคงที่

// const ชนิดข้อมูล ชื่อตัวแปร = ค่าที่กำหนด;

const double PI = 3.14159;
const String APP_NAME = "Dart Learning";
const int MAX_USERS = 100;

// ===== final (Runtime Constant) =====
//final สามารถกำหนดค่าได้ในภายหลัง แต่จะต้องกำหนดค่าเพียงครั้งเดียว
//ค่าจะถูกคำนวณในเวลารันไทม์ (runtime constant)

//final ชนิดข้อมูล ชื่อตัวแปร = ค่าที่กำหนด;

final double RATE = 87.75;



//สรุปความแตกต่างระหว่าง const และ final
/*
- const: ค่าต้องถูกกำหนดในขณะที่ประกาศตัวแปร
          ค่าจะถูกคำนวณในเวลาคอมไพล์ (compile-time constant)
          ใช้สำหรับค่าที่ไม่เปลี่ยนแปลงและสามารถคำนวณได้ล่วงหน้า

- final: ค่าสามารถกำหนดได้ในภายหลัง แต่ต้องกำหนดค่าเพียงครั้งเดียว
          ค่าจะถูกคำนวณในเวลารันไทม์ (runtime constant)
          ใช้สำหรับค่าที่ไม่เปลี่ยนแปลงแต่ไม่สามารถคำนวณได้ล่วงหน้า
*/